src/app/Http/Controllers/UserController.php

  public function show(string $name)
  {
    // whereメソッドで最大でも１件取得
    $user = User::where('name', $name)->first();
---
select * from `users` where `name` = '例1さん' limit 1

  public function likes(string $name)
  {
    // $userに最大での１件を取得させている
    $user = User::where('name', $name)->first()->load(['likes.user', 'likes.likes', 'likes.tags']);
---
select * from `users` where `users`.`id` in (9, 13)

  public function followings(string $name)
  {
    // $userに最大で１件を取得させている
    $user = User::where('name', $name)->first()->load('followings.followers');
---
select `users`.*, `follows`.`follower_id` as `pivot_follower_id`, `follows`.`followee_id` as `pivot_followee_id`, `follows`.`created_at` as `pivot_created_at`, `follows`.`updated_at` as `pivot_updated_at` from `users` inner join `follows` on `users`.`id` = `follows`.`followee_id` where `follows`.`follower_id` in (7)

  public function followers(string $name)
  {
    // $userに最大で１件を取得
    $user = User::where('name', $name)->first()->load('followers.followers');
---
select * from `users` where `name` = 'ワタナベレオ' limit 1

  public function follow(Request $request, string $name)
  {
    // whereメソッドでユーザーモデルをコレクションとして渡してfirstメソッドで最初の１けんのユーザーを取得
    $user = User::where('name', $name)->first()->load(['articles.user', 'articles.likes', 'articles.tags']);

    // 自分自身をフォローできないようにする
    if ($user->id === $request->user()->id) {
      // abort関数で第一引数にステータスコードを渡す
      return abort('404', 'Cannot follow yourself');
      // 一人のユーザーが複数重ねてフォローできないようにdetachから実装
      $request->user()->followings()->detach($user);
      $request->user()->followings()->attach($user);
---
select * from `articles` where `articles`.`user_id` in (15)
select `tags`.*, `article_tag`.`article_id` as `pivot_article_id`, `article_tag`.`tag_id` as `pivot_tag_id`, `article_tag`.`created_at` as `pivot_created_at`, `article_tag`.`updated_at` as `pivot_updated_at` from `tags` inner join `article_tag` on `tags`.`id` = `article_tag`.`tag_id` where `article_tag`.`article_id` in (11)
select `users`.*, `likes`.`article_id` as `pivot_article_id`, `likes`.`user_id` as `pivot_user_id`, `likes`.`created_at` as `pivot_created_at`, `likes`.`updated_at` as `pivot_updated_at` from `users` inner join `likes` on `users`.`id` = `likes`.`user_id` where `likes`.`article_id` in (11)
insert into `follows` (`created_at`, `followee_id`, `follower_id`, `updated_at`) values ('2022-01-29 13:32:26', 15, 7, '2022-01-29 13:32:26')

  public function unfollow(Request $request, string $name)
  {
    // whereメソッドでUserモデルをコレクションに渡しfirstメソッドで最初の１件のユーザーを取得
    $user = User::where('name', $name)->first();
---
select * from `users` where `name` = '例1さん' limit 1