src/app/Http/Controllers/Auth/LoginController.php

  public function handleProviderCallback(Request $request, string $provider)
  {
    // Googleからユーザー情報を取得
    $providerUser = Socialite::driver($provider)->stateless()->user();
    // Googleのメールアドレスを元にユーザーモデルを取得
    $user = User::where('email', $providerUser->getEmail())->first();
---
select * from `users` where `email` = 'pom123re0624@gmail.com' limit 1